                                                                 HONEI PROJECT

### `Libraries`

In [181]:
#Importing libraries for MySQL connection
#-----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importing libraries for data manipulation and analysis
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

_ _ _

### `Reading CSVs`

In [182]:
# Reading the CSV files 
# -----------------------------------------------------------------------
continents_data = pd.read_csv('continents.csv')
countries_data = pd.read_csv('countries.csv')
per_capita_data = pd.read_csv('per_capita.csv')
continent_map_data = pd.read_csv('continent_map.csv')

# Creating copies of the DataFrames, it's always recommended to avoid modifying the originals
# -----------------------------------------------------------------------
continents_df = continents_data.copy()
countries_df = countries_data.copy()
per_capita_df = per_capita_data.copy()
continent_map_df = continent_map_data.copy()

_ _ _

### `Data Exploration`

* First Look:

In [183]:
# Printing DataFrames for a quick look
# -----------------------------------------------------------------------
continents_df

  continent_code continent_name
0             AF         Africa
1             AS           Asia
2             EU         Europe
3            NaN  North America
4             SA  South America
5             OC        Oceania
6             AN     Antarctica

In [184]:
countries_df

    country_code      country_name
0            ABW             Aruba
1            AND           Andorra
2            AFG       Afghanistan
3            AGO            Angola
4            ALB           Albania
..           ...               ...
247          YEM       Yemen, Rep.
248          ZAF      South Africa
249          COD  Congo, Dem. Rep.
250          ZMB            Zambia
251          ZWE          Zimbabwe

[252 rows x 2 columns]

In [185]:
per_capita_df

     country_code  year  gdp_per_capita
0             ABW  2004    22566.682160
1             AND  2004    29372.166740
2             AFG  2004      220.056288
3             AGO  2004     1229.342988
4             ALB  2004     2320.892330
...           ...   ...             ...
2074          YEM  2012     1498.261568
2075          ZAF  2012     7351.756648
2076          COD  2012      261.836335
2077          ZMB  2012     1462.887261
2078          ZWE  2012      714.233007

[2079 rows x 3 columns]

In [186]:
continent_map_df

    country_code continent_code
0            ABW            NaN
1            AFG             AS
2            AGO             AF
3            AIA            NaN
4            ALA             EU
..           ...            ...
258          WSM             OC
259          YEM             AS
260          ZAF             AF
261          ZMB             AF
262          ZWE             AF

[263 rows x 2 columns]

_ _ _

* Inspecting Data Types:

In [187]:
# Viewing basic information and data types of each Dataframe
# -----------------------------------------------------------------------
countries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252 entries, 0 to 251
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_code  252 non-null    object
 1   country_name  252 non-null    object
dtypes: object(2)
memory usage: 4.1+ KB

In [188]:
continents_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   continent_code  6 non-null      object
 1   continent_name  7 non-null      object
dtypes: object(2)
memory usage: 244.0+ bytes

In [189]:
per_capita_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2079 entries, 0 to 2078
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country_code    2079 non-null   object
 1   year            2079 non-null   int64
 2   gdp_per_capita  2025 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 48.9+ KB

In [190]:
continent_map_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263 entries, 0 to 262
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country_code    259 non-null    object
 1   continent_code  220 non-null    object
dtypes: object(2)
memory usage: 4.2+ KB

_ _ _

* Getting Descriptive Statistics:

In [191]:
# Viewing descriptive statistics to understand data distribution, identify outliers, summarize data,
# check data integrity, and guide further analysis
# -----------------------------------------------------------------------
countries_df.describe()

       country_code country_name
count           252          252
unique          252          252
top             ABW        Aruba
freq              1            1

In [192]:
continents_df.describe()

       continent_code continent_name
count               6              7
unique              6              7
top                AF         Africa
freq                1              1

In [193]:
per_capita_df.describe()

             year  gdp_per_capita
count  2079.00000     2025.000000
mean   2008.00000    13322.167958
std       2.58261    20645.056009
min    2004.00000      121.859304
25%    2006.00000     1253.112383
50%    2008.00000     4486.555676
75%    2010.00000    15871.500140
max    2012.00000   193892.322300

In [194]:
continent_map_df.describe()

       country_code continent_code
count           259            220
unique          250              6
top             ARM             AF
freq              3             59

_ _ _

* Checking Duplicates:

In [195]:
# Checking for duplicates to identify any duplicate information that could skew the calculations later
# -----------------------------------------------------------------------
continents_df.duplicated().sum()

0

In [196]:
countries_df.duplicated().sum()

0

In [197]:
per_capita_df.duplicated().sum()

0

In [198]:
continent_map_df.duplicated().sum()

2

* Checking Nulls:

In [199]:
# Counting Null Values is essential for working with SQL
# -----------------------------------------------------------------------
continents_df.isnull().sum()

continent_code    1
continent_name    0
dtype: int64

In [200]:
countries_df.isnull().sum()

country_code    0
country_name    0
dtype: int64

In [201]:
per_capita_df.isnull().sum()

country_code       0
year               0
gdp_per_capita    54
dtype: int64

In [202]:
continent_map_df.isnull().sum()

country_code       4
continent_code    43
dtype: int64

_ _ _

* Exploring Unique Values:

In [203]:
# Exploring unique values to understand data diversity and detect inconsistencies
# -----------------------------------------------------------------------
def print_unique_values(df):
    # Imprimir valores Ãºnicos de cada columna
    for column in df.columns:
        print(f"Column: {column}")
        print(df[column].unique())
        print("\n--------------------\n")

In [204]:
print_unique_values(continents_df)

Column: continent_code
['AF' 'AS' 'EU' nan 'SA' 'OC' 'AN']

--------------------

Column: continent_name
['Africa' 'Asia' 'Europe' 'North America' 'South America' 'Oceania'
 'Antarctica']

--------------------

In [205]:
print_unique_values(countries_df)

Column: country_code
['ABW' 'AND' 'AFG' 'AGO' 'ALB' 'ARB' 'ARE' 'ARG' 'ARM' 'ASM' 'ATG' 'AUS'
 'AUT' 'AZE' 'BDI' 'BEL' 'BEN' 'BFA' 'BGD' 'BGR' 'BHR' 'BHS' 'BIH' 'BLR'
 'BLZ' 'BMU' 'BOL' 'BRA' 'BRB' 'BRN' 'BTN' 'BWA' 'CAA' 'CAF' 'CAN' 'CEA'
 'CEU' 'CHE' 'CHI' 'CHL' 'CHN' 'CIV' 'CLA' 'CME' 'CMR' 'COG' 'COL' 'COM'
 'CPV' 'CRI' 'CSA' 'CSS' 'CUB' 'CUW' 'CYM' 'CYP' 'CZE' 'DEU' 'DJI' 'DMA'
 'DNK' 'DOM' 'DZA' 'EAP' 'EAS' 'ECA' 'ECS' 'ECU' 'EGY' 'EMU' 'ERI' 'ESP'
 'EST' 'ETH' 'EUU' 'FIN' 'FJI' 'FRA' 'FRO' 'FSM' 'GAB' 'GBR' 'GEO' 'GHA'
 'GIN' 'GMB' 'GNB' 'GNQ' 'GRC' 'GRD' 'GRL' 'GTM' 'GUM' 'GUY' 'HIC' 'HKG'
 'HND' 'HPC' 'HRV' 'HTI' 'HUN' 'IDN' 'IMN' 'IND' 'INX' 'IRL' 'IRN' 'IRQ'
 'ISL' 'ISR' 'ITA' 'JAM' 'JOR' 'JPN' 'KAZ' 'KEN' 'KGZ' 'KHM' 'KIR' 'KNA'
 'KOR' 'KSV' 'KWT' 'LAC' 'LAO' 'LBN' 'LBR' 'LBY' 'LCA' 'LCN' 'LDC' 'LIC'
 'LIE' 'LKA' 'LMC' 'LMY' 'LSO' 'LTU' 'LUX' 'LVA' 'MAC' 'MAF' 'MAR' 'MCO'
 'MDA' 'MDG' 'MDV' 'MEA' 'MEX' 'MHL' 'MIC' 'MKD' 'MLI' 'MLT' 'MMR' 'MNA'
 'MNE' 'MNG' 'MNP' 'MOZ' 'MRT' 'MUS' 'MWI' 'MYS' 'NAC' 'NAM' 'NCL' 'NER'
 'NGA' 'NIC' 'NLD' 'NOC' 'NOR' 'NPL' 'NZL' 'OEC' 'OED' 'OMN' 'OSS' 'PAK'
 'PAN' 'PER' 'PHL' 'PLW' 'PNG' 'POL' 'PRI' 'PRK' 'PRT' 'PRY' 'PSS' 'PYF'
 'QAT' 'ROU' 'RUS' 'RWA' 'SAS' 'SAU' 'SDN' 'SEN' 'SGP' 'SLB' 'SLE' 'SLV'
 'SMR' 'SOM' 'SRB' 'SSA' 'SSD' 'SSF' 'SST' 'STP' 'SUR' 'SVK' 'SVN' 'SWE'
 'SWZ' 'SXM' 'SYC' 'SYR' 'TCA' 'TCD' 'TGO' 'THA' 'TJK' 'TKM' 'TLS' 'TON'
 'TTO' 'TUN' 'TUR' 'TUV' 'TZA' 'UGA' 'UKR' 'UMC' 'URY' 'USA' 'UZB' 'VCT'
 'VEN' 'VIR' 'VNM' 'VUT' 'PSE' 'WLD' 'WSM' 'YEM' 'ZAF' 'COD' 'ZMB' 'ZWE']

--------------------

Column: country_name
['Aruba' 'Andorra' 'Afghanistan' 'Angola' 'Albania' 'Arab World'
 'United Arab Emirates' 'Argentina' 'Armenia' 'American Samoa'
 'Antigua and Barbuda' 'Australia' 'Austria' 'Azerbaijan' 'Burundi'
 'Belgium' 'Benin' 'Burkina Faso' 'Bangladesh' 'Bulgaria' 'Bahrain'
 'Bahamas, The' 'Bosnia and Herzegovina' 'Belarus' 'Belize' 'Bermuda'
 'Bolivia' 'Brazil' 'Barbados' 'Brunei Darussalam' 'Bhutan' 'Botswana'
 'Sub-Saharan Africa (IFC classification)' 'Central African Republic'
 'Canada' 'East Asia and the Pacific (IFC classification)'
 'Europe and Central Asia (IFC classification)' 'Switzerland'
 'Channel Islands' 'Chile' 'China' "Cote d'Ivoire"
 'Latin America and the Caribbean (IFC classification)'
 'Middle East and North Africa (IFC classification)' 'Cameroon'
 'Congo, Rep.' 'Colombia' 'Comoros' 'Cabo Verde' 'Costa Rica'
 'South Asia (IFC classification)' 'Caribbean small states' 'Cuba'
 'Curacao' 'Cayman Islands' 'Cyprus' 'Czech Republic' 'Germany' 'Djibouti'
 'Dominica' 'Denmark' 'Dominican Republic' 'Algeria'
 'East Asia & Pacific (developing only)'
 'East Asia & Pacific (all income levels)'
 'Europe & Central Asia (developing only)'
 'Europe & Central Asia (all income levels)' 'Ecuador' 'Egypt, Arab Rep.'
 'Euro area' 'Eritrea' 'Spain' 'Estonia' 'Ethiopia' 'European Union'
 'Finland' 'Fiji' 'France' 'Faeroe Islands' 'Micronesia, Fed. Sts.'
 'Gabon' 'United Kingdom' 'Georgia' 'Ghana' 'Guinea' 'Gambia, The'
 'Guinea-Bissau' 'Equatorial Guinea' 'Greece' 'Grenada' 'Greenland'
 'Guatemala' 'Guam' 'Guyana' 'High income' 'Hong Kong SAR, China'
 'Honduras' 'Heavily indebted poor countries (HIPC)' 'Croatia' 'Haiti'
 'Hungary' 'Indonesia' 'Isle of Man' 'India' 'Not classified' 'Ireland'
 'Iran, Islamic Rep.' 'Iraq' 'Iceland' 'Israel' 'Italy' 'Jamaica' 'Jordan'
 'Japan' 'Kazakhstan' 'Kenya' 'Kyrgyz Republic' 'Cambodia' 'Kiribati'
 'St. Kitts and Nevis' 'Korea, Rep.' 'Kosovo' 'Kuwait'
 'Latin America & Caribbean (developing only)' 'Lao PDR' 'Lebanon'
 'Liberia' 'Libya' 'St. Lucia'
 'Latin America & Caribbean (all income levels)'
 'Least developed countries: UN classification' 'Low income'
 'Liechtenstein' 'Sri Lanka' 'Lower middle income' 'Low & middle income'
 'Lesotho' 'Lithuania' 'Luxembourg' 'Latvia' 'Macao SAR, China'
 'St. Martin (French part)' 'Morocco' 'Monaco' 'Moldova' 'Madagascar'
 'Maldives' 'Middle East & North Africa (all income levels)' 'Mexico'
 'Marshall Islands' 'Middle income' 'Macedonia, FYR' 'Mali' 'Malta'
 'Myanmar' 'Middle East & North Africa (developing only)' 'Montenegro'
 'Mongolia' 'Northern Mariana Islands' 'Mozambique' 'Mauritania'
 'Mauritius' 'Malawi' 'Malaysia' 'North America' 'Namibia' 'New Caledonia'
 'Niger' 'Nigeria' 'Nicaragua' 'Netherlands' 'High income: nonOECD'
 'Norway' 'Nepal' 'New Zealand' 'High income: OECD' 'OECD members' 'Oman'
 'Other small states' 'Pakistan' 'Panama' 'Peru' 'Philippines' 'Palau'
 'Papua New Guinea' 'Poland' 'Puerto Rico' 'Korea, Dem. Rep.' 'Portugal'
 'Paraguay' 'Pacific island small states' 'French Polynesia' 'Qatar'
 'Romania' 'Russian Federation' 'Rwanda' 'South Asia' 'Saudi Arabia'
 'Sudan' 'Senegal' 'Singapore' 'Solomon Islands' 'Sierra Leone'
 'El Salvador' 'San Marino' 'Somalia' 'Serbia'
 'Sub-Saharan Africa (developing only)' 'South Sudan'
 'Sub-Saharan Africa (all income levels)' 'Small states'
 'Sao Tome and Principe' 'Suriname' 'Slovak Republic' 'Slovenia' 'Sweden'
 'Swaziland' 'Sint Maarten (Dutch part)' 'Seychelles'
 'Syrian Arab Republic' 'Turks and Caicos Islands' 'Chad' 'Togo'
 'Thailand' 'Tajikistan' 'Turkmenistan' 'Timor-Leste' 'Tonga'
 'Trinidad and Tobago' 'Tunisia' 'Turkey' 'Tuvalu' 'Tanzania' 'Uganda'
 'Ukraine' 'Upper middle income' 'Uruguay' 'United States' 'Uzbekistan'
 'St. Vincent and the Grenadines' 'Venezuela, RB' 'Virgin Islands (U.S.)'
 'Vietnam' 'Vanuatu' 'West Bank and Gaza' 'World' 'Samoa' 'Yemen, Rep.'
 'South Africa' 'Congo, Dem. Rep.' 'Zambia' 'Zimbabwe']

--------------------

In [206]:
print_unique_values(per_capita_df)

Column: country_code
['ABW' 'AND' 'AFG' 'AGO' 'ALB' 'ARB' 'ARE' 'ARG' 'ARM' 'ATG' 'AUS' 'AUT'
 'AZE' 'BDI' 'BEL' 'BEN' 'BFA' 'BGD' 'BGR' 'BHR' 'BHS' 'BIH' 'BLR' 'BLZ'
 'BMU' 'BOL' 'BRA' 'BRB' 'BRN' 'BTN' 'BWA' 'CAF' 'CAN' 'CHE' 'CHI' 'CHL'
 'CHN' 'CIV' 'CMR' 'COG' 'COL' 'COM' 'CPV' 'CRI' 'CSS' 'CUB' 'CYP' 'CZE'
 'DEU' 'DJI' 'DMA' 'DNK' 'DOM' 'DZA' 'EAP' 'EAS' 'ECA' 'ECS' 'ECU' 'EGY'
 'EMU' 'ERI' 'ESP' 'EST' 'ETH' 'EUU' 'FIN' 'FJI' 'FRA' 'FRO' 'FSM' 'GAB'
 'GBR' 'GEO' 'GHA' 'GIN' 'GMB' 'GNB' 'GNQ' 'GRC' 'GRD' 'GRL' 'GTM' 'GUY'
 'HIC' 'HKG' 'HND' 'HPC' 'HRV' 'HTI' 'HUN' 'IDN' 'IMN' 'IND' 'IRL' 'IRN'
 'IRQ' 'ISL' 'ISR' 'ITA' 'JAM' 'JOR' 'JPN' 'KAZ' 'KEN' 'KGZ' 'KHM' 'KIR'
 'KNA' 'KOR' 'KSV' 'KWT' 'LAC' 'LAO' 'LBN' 'LBR' 'LBY' 'LCA' 'LCN' 'LDC'
 'LIC' 'LIE' 'LKA' 'LMC' 'LMY' 'LSO' 'LTU' 'LUX' 'LVA' 'MAC' 'MAR' 'MCO'
 'MDA' 'MDG' 'MDV' 'MEA' 'MEX' 'MHL' 'MIC' 'MKD' 'MLI' 'MLT' 'MNA' 'MNE'
 'MNG' 'MOZ' 'MRT' 'MUS' 'MWI' 'MYS' 'NAC' 'NAM' 'NER' 'NGA' 'NIC' 'NLD'
 'NOC' 'NOR' 'NPL' 'NZL' 'OEC' 'OED' 'OMN' 'OSS' 'PAK' 'PAN' 'PER' 'PHL'
 'PLW' 'PNG' 'POL' 'PRI' 'PRT' 'PRY' 'PSS' 'QAT' 'ROU' 'RUS' 'RWA' 'SAS'
 'SAU' 'SDN' 'SEN' 'SGP' 'SLB' 'SLE' 'SLV' 'SMR' 'SRB' 'SSA' 'SSD' 'SSF'
 'SST' 'STP' 'SUR' 'SVK' 'SVN' 'SWE' 'SWZ' 'SYC' 'SYR' 'TCD' 'TGO' 'THA'
 'TJK' 'TKM' 'TLS' 'TON' 'TTO' 'TUN' 'TUR' 'TUV' 'TZA' 'UGA' 'UKR' 'UMC'
 'URY' 'USA' 'UZB' 'VCT' 'VEN' 'VNM' 'VUT' 'PSE' 'WLD' 'WSM' 'YEM' 'ZAF'
 'COD' 'ZMB' 'ZWE']

--------------------

Column: year
[2004 2005 2006 2007 2008 2009 2010 2011 2012]

--------------------

Column: gdp_per_capita
[22566.68216   29372.16674     220.0562878 ...   261.836335   1462.887261
   714.2330072]

--------------------

In [207]:
print_unique_values(continent_map_df)

Column: country_code
['ABW' 'AFG' 'AGO' 'AIA' 'ALA' 'ALB' 'AND' 'ANT' 'ARE' 'ARG' 'ARM' 'ASM'
 'ATA' 'ATF' 'ATG' 'AUS' 'AUT' 'AZE' 'BDI' 'BEL' 'BEN' 'BES' 'BFA' 'BGD'
 'BGR' 'BHR' 'BHS' 'BIH' 'BLM' 'BLR' 'BLZ' 'BMU' 'BOL' 'BRA' 'BRB' 'BRN'
 'BTN' 'BVT' 'BWA' 'CAF' 'CAN' 'CCK' 'CHE' 'CHL' 'CHN' 'CIV' 'CMR' 'COD'
 'COG' 'COK' 'COL' 'COM' 'CPV' 'CRI' 'CUB' 'CUW' 'CXR' 'CYM' 'CYP' 'CZE'
 'DEU' 'DJI' 'DMA' 'DNK' 'DOM' 'DZA' 'ECU' 'EGY' 'ERI' 'ESH' 'ESP' 'EST'
 'ETH' 'FIN' 'FJI' 'FLK' 'FRA' 'FRO' 'FSM' 'GAB' 'GBR' 'GEO' 'GGY' 'GHA'
 'GIB' 'GIN' 'GLP' 'GMB' 'GNB' 'GNQ' 'GRC' 'GRD' 'GRL' 'GTM' 'GUF' 'GUM'
 'GUY' 'HKG' 'HMD' 'HND' 'HRV' 'HTI' 'HUN' 'IDN' 'IMN' 'IND' 'IOT' 'IRL'
 'IRN' 'IRQ' 'ISL' 'ISR' 'ITA' 'JAM' 'JEY' 'JOR' 'JPN' 'KAZ' 'KEN' 'KGZ'
 'KHM' 'KIR' 'KNA' 'KOR' 'KWT' 'LAO' 'LBN' 'LBR' 'LBY' 'LCA' 'LIE' 'LKA'
 'LSO' 'LTU' 'LUX' 'LVA' 'MAC' 'MAF' 'MAR' 'MCO' 'MDA' 'MDG' 'MDV' 'MEX'
 'MHL' 'MKD' 'MLI' 'MLT' 'MMR' 'MNE' 'MNG' 'MNP' 'MOZ' 'MRT' 'MSR' 'MTQ'
 'MUS' 'MWI' 'MYS' 'MYT' 'NAM' 'NCL' 'NER' 'NFK' 'NGA' 'NIC' 'NIU' 'NLD'
 'NOR' 'NPL' 'NRU' nan 'NZL' 'OMN' 'PAK' 'PAN' 'PCN' 'PER' 'PHL' 'PLW'
 'PNG' 'POL' 'PRI' 'PRK' 'PRT' 'PRY' 'PSE' 'PYF' 'QAT' 'REU' 'ROU' 'RUS'
 'RWA' 'SAU' 'SDN' 'SEN' 'SGP' 'SGS' 'SHN' 'SJM' 'SLB' 'SLE' 'SLV' 'SMR'
 'SOM' 'SPM' 'SRB' 'SSD' 'STP' 'SUR' 'SVK' 'SVN' 'SWE' 'SWZ' 'SXM' 'SYC'
 'SYR' 'TCA' 'TCD' 'TGO' 'THA' 'TJK' 'TKL' 'TKM' 'TLS' 'TON' 'TTO' 'TUN'
 'TUR' 'TUV' 'TWN' 'TZA' 'UGA' 'UKR' 'UMI' 'URY' 'USA' 'UZB' 'VAT' 'VCT'
 'VEN' 'VGB' 'VIR' 'VNM' 'VUT' 'WLF' 'WSM' 'YEM' 'ZAF' 'ZMB' 'ZWE']

--------------------

Column: continent_code
[nan 'AS' 'AF' 'EU' 'SA' 'OC' 'AN']

--------------------

_ _ _

### `Connecting to MySQL`

In [208]:
# Now I create the MySQL connection
# -----------------------------------------------------------------------
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


# Create a cursor object to interact with the database
mycursor = cnx.cursor()
# Select the database
mycursor.execute("USE honei_1")

_ _ _

### `Data Import`

In [209]:
# Function to import data from a DataFrame to MySQL
# -----------------------------------------------------------------------
def import_to_mysql(cnx, df, table_name):
    # Create a cursor object to interact with the database
    cursor = cnx.cursor()
    # Convert the DataFrame columns to a comma-separated string
    cols = ",".join([str(i) for i in df.columns.tolist()])
    
    # Iterate over each row in the DataFrame
    for i, row in df.iterrows():
        # Prepare the SQL INSERT statement with placeholders for the row values
        sql = f"INSERT INTO {table_name} ({cols}) VALUES ({'%s, ' * (len(row) - 1)}%s)"
        # Execute the SQL statement with the row values
        cursor.execute(sql, tuple(row))
    
    # Commit the transaction to save changes
    cnx.commit()
    # Close the cursor
    cursor.close()

In [210]:
# Calling the Function
# Commented out to prevent it from running on every 'Run All' execution. Uncomment to activate.
# -----------------------------------------------------------------------

import_to_mysql(cnx, continents_df, 'continents')
import_to_mysql(cnx, countries_df, 'countries' )
import_to_mysql(cnx, per_capita_df, 'per_capita')
import_to_mysql(cnx, continent_map_df, 'continent_map')

print("Data imported successfully")

Data imported successfully

                                                                                         THE END